experiment/test_fio/result/zns/randread/fio_rw_1_400M_file.txt
file1: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=8
fio-3.36-19-gbdf99
Starting 1 process
file1: Laying out IO file (1 file / 400MiB)

file1: (groupid=0, jobs=1): err= 0: pid=6818: Sun Dec  3 18:39:22 2023
  read: IOPS=91.8k, BW=1434MiB/s (1503MB/s)(400MiB/279msec)
    slat (usec): min=3, max=432, avg=10.48, stdev=11.15
    clat (usec): min=21, max=1232, avg=76.25, stdev=44.33
     lat (usec): min=24, max=1363, avg=86.73, stdev=50.25
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   51], 10.00th=[   57], 20.00th=[   62],
     | 30.00th=[   65], 40.00th=[   68], 50.00th=[   71], 60.00th=[   73],
     | 70.00th=[   76], 80.00th=[   80], 90.00th=[   86], 95.00th=[   93],
     | 99.00th=[  338], 99.50th=[  383], 99.90th=[  510], 99.95th=[  594],
     | 99.99th=[  971]
  lat (usec)   : 50=4.24%, 100=92.18%, 250=1.74%, 500=1.73%, 750=0.09%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.44%, sys=97.84%, ctx=4, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=25600,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1434MiB/s (1503MB/s), 1434MiB/s-1434MiB/s (1503MB/s-1503MB/s), io=400MiB (419MB), run=279-279msec

Disk stats (read/write):
  nvme0n2: ios=10572/0, sectors=338304/0, merge=0/0, ticks=244/0, in_queue=244, util=51.95%