experiment/test_fio/result/zns/randread/fio_rw_1_400M_file.txt
file1: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=8
fio-3.36-19-gbdf99
Starting 1 process
file1: Laying out IO file (1 file / 400MiB)

file1: (groupid=0, jobs=1): err= 0: pid=5315: Sun Dec  3 17:53:18 2023
  read: IOPS=85.9k, BW=1342MiB/s (1407MB/s)(400MiB/298msec)
    slat (usec): min=3, max=398, avg=11.07, stdev=13.07
    clat (usec): min=13, max=1479, avg=81.22, stdev=66.93
     lat (usec): min=23, max=1667, avg=92.30, stdev=75.72
    clat percentiles (usec):
     |  1.00th=[   46],  5.00th=[   53], 10.00th=[   58], 20.00th=[   63],
     | 30.00th=[   66], 40.00th=[   69], 50.00th=[   72], 60.00th=[   74],
     | 70.00th=[   78], 80.00th=[   82], 90.00th=[   92], 95.00th=[  121],
     | 99.00th=[  478], 99.50th=[  644], 99.90th=[  807], 99.95th=[  889],
     | 99.99th=[ 1319]
  lat (usec)   : 20=0.01%, 50=2.89%, 100=88.41%, 250=7.15%, 500=0.62%
  lat (usec)   : 750=0.72%, 1000=0.19%
  lat (msec)   : 2=0.02%
  cpu          : usr=2.69%, sys=96.97%, ctx=4, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=25600,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1342MiB/s (1407MB/s), 1342MiB/s-1342MiB/s (1407MB/s-1407MB/s), io=400MiB (419MB), run=298-298msec

Disk stats (read/write):
  nvme0n2: ios=9521/0, sectors=304672/0, merge=0/0, ticks=196/0, in_queue=192, util=52.10%