experiment/test_fio/result/zns/randread/fio_rw_1_400M_file.txt
file1: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=8
fio-3.36-19-gbdf99
Starting 1 process
file1: Laying out IO file (1 file / 400MiB)

file1: (groupid=0, jobs=1): err= 0: pid=7401: Sun Dec  3 19:05:06 2023
  read: IOPS=91.4k, BW=1429MiB/s (1498MB/s)(400MiB/280msec)
    slat (usec): min=3, max=183, avg=10.48, stdev=10.14
    clat (usec): min=16, max=584, avg=76.57, stdev=38.36
     lat (usec): min=22, max=652, avg=87.05, stdev=43.21
    clat percentiles (usec):
     |  1.00th=[   46],  5.00th=[   54], 10.00th=[   59], 20.00th=[   63],
     | 30.00th=[   67], 40.00th=[   69], 50.00th=[   72], 60.00th=[   74],
     | 70.00th=[   77], 80.00th=[   81], 90.00th=[   87], 95.00th=[   93],
     | 99.00th=[  310], 99.50th=[  363], 99.90th=[  445], 99.95th=[  469],
     | 99.99th=[  529]
  lat (usec)   : 20=0.01%, 50=2.94%, 100=93.54%, 250=1.93%, 500=1.57%
  lat (usec)   : 750=0.02%
  cpu          : usr=1.43%, sys=97.49%, ctx=10, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=25600,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=1429MiB/s (1498MB/s), 1429MiB/s-1429MiB/s (1498MB/s-1498MB/s), io=400MiB (419MB), run=280-280msec

Disk stats (read/write):
  nvme0n2: ios=10368/0, sectors=331776/0, merge=0/0, ticks=264/0, in_queue=264, util=50.88%